In [146]:
import pandas as pd
from sqlalchemy import create_engine
import os
import numpy as np

In [189]:
BS_file= "..\Desktop\HoneyBumbleBeez.github.io\Resources\Survey_ByState.csv"

BS_df= pd.read_csv(BS_file, encoding='utf8')
NewBee = BS_df.drop(['Week Ending', 'State ANSI', 'Watershed', 'CV (%)'], axis =1)

NewBee.rename(columns = {'Value':'Count'}, inplace = True) 

NewBee.head()

   Year        Period       State         Data Item    Count
0  2017  JAN THRU MAR     ALABAMA  ADDED & REPLACED      570
1  2017  JAN THRU MAR     ARIZONA  ADDED & REPLACED    2,900
2  2017  JAN THRU MAR    ARKANSAS  ADDED & REPLACED      430
3  2017  JAN THRU MAR  CALIFORNIA  ADDED & REPLACED  215,000
4  2017  JAN THRU MAR    COLORADO  ADDED & REPLACED      100

In [148]:
NewBee.dtypes

Year          int64
Period       object
State        object
Data Item    object
Count        object
dtype: object

In [156]:
NewBee['Count'].replace(regex=True,inplace=True,to_replace=r'\D',value=r'')

In [183]:
NewBee['Count'] = NewBee['Count'].astype(str).astype(int)

In [184]:
mark_Newbee = NewBee[NewBee["Period"] != "MARKETING YEAR"].copy()
no_first_df = mark_Newbee[~mark_Newbee["Period"].str.contains("FIRST")].copy()

In [185]:
x = no_first_df.groupby(['Year', 'Period']).sum()[["Count"]]
x.head()

                     Count
Year Period
2015 APR THRU JUN  4906840
     JAN THRU MAR  4654550
     JUL THRU SEP  4151340
     OCT THRU DEC  4232700
2016 APR THRU JUN  5117880